app/views/comments/_comment.haml

INSERT INTO "comments" ("user_id", "content", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["content", "test"], ["category_id", 2], ["created_at", "2019-11-14 10:00:28.599410"], ["updated_at", "2019-11-14 10:00:28.599410"]]
---
  %p
    = comment.created_at