app/views/posts/_form.haml

SELECT "categories".* FROM "categories"
---
  %p
    = f.collection_select :category_id, Category.all, :id, :name, {:prompt => 'Select category'}, {class: "form-control"}