app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test"], ["description", "test test"], ["created_at", "2019-11-12 08:07:11.546053"], ["updated_at", "2019-11-12 08:07:11.546053"], ["user_id", 1]]
---
  def create
    @category = Category.new(category_params)
    if @category.save