app/controllers/comments_controller.rb

  def create
    @comment = if @category.present?
                 @category.comments.new(comment_params)
               else
                 @post.comments.new(comment_params)
               end
    @comment.save
---
INSERT INTO "comments" ("user_id", "content", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["content", "222"], ["category_id", 3], ["created_at", "2019-11-14 10:38:07.584597"], ["updated_at", "2019-11-14 10:38:07.584597"]]

  def set_category
    @category = Category.find(params[:category_id]) if params[:category_id].present?
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def set_post
    @post = Post.find(params[:post_id]) if params[:post_id].present?
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]