app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "content", "category_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "asdasd"], ["content", "asdasdasdasd"], ["category_id", 2], ["user_id", 1], ["created_at", "2019-11-12 10:37:56.661911"], ["updated_at", "2019-11-12 10:37:56.661911"]]
---
  def create
    @post = Post.new(post_params)
    if @post.save