app/views/categories/show.haml

  %h1 Posts
- @category.posts.each do |post|
---
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1  [["category_id", 2]]